## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-06-09T16:12:08.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:8/invocations" -> (known after apply)
      ~ s3_key                         = "builds/3ea2aba12982bf03c5182aa1bae2def06525a059f32ff0d373fb3f9326aae160.zip" -> "builds/60f03d17b515b17f3781e127ca0a6bf4e8b83ac92c22c8a25b9165e7dbad2fe1.zip"
      ~ s3_object_version              = "_knp4c77gCpweP81OKLDJL_9xNVT2Iwf" -> (known after apply)
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:b1034a15ea75fb460b2753400ca2d904ddcfe290,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "b1034a15ea75fb460b2753400ca2d904ddcfe290"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "8" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "9119ac2ae42d55b140d90983d3b9d33b-2" -> (known after apply)
      ~ id                     = "builds/3ea2aba12982bf03c5182aa1bae2def06525a059f32ff0d373fb3f9326aae160.zip" -> (known after apply)
      ~ key                    = "builds/3ea2aba12982bf03c5182aa1bae2def06525a059f32ff0d373fb3f9326aae160.zip" -> "builds/60f03d17b515b17f3781e127ca0a6bf4e8b83ac92c22c8a25b9165e7dbad2fe1.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/3ea2aba12982bf03c5182aa1bae2def06525a059f32ff0d373fb3f9326aae160.zip" -> "builds/60f03d17b515b17f3781e127ca0a6bf4e8b83ac92c22c8a25b9165e7dbad2fe1.zip"
-       tags                   = {} -> null
      ~ version_id             = "_knp4c77gCpweP81OKLDJL_9xNVT2Iwf" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadFFISSpreadsheet
                            cd bin/DownloadFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/60f03d17b515b17f3781e127ca0a6bf4e8b83ac92c22c8a25b9165e7dbad2fe1.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/60f03d17b515b17f3781e127ca0a6bf4e8b83ac92c22c8a25b9165e7dbad2fe1.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7784324557405157798" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3ea2aba12982bf03c5182aa1bae2def06525a059f32ff0d373fb3f9326aae160.zip" -> "builds/60f03d17b515b17f3781e127ca0a6bf4e8b83ac92c22c8a25b9165e7dbad2fe1.zip"
          ~ "timestamp" = "1686327096222672000" -> "1687385488766062000"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "5631970978334952737" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/3ea2aba12982bf03c5182aa1bae2def06525a059f32ff0d373fb3f9326aae160.zip" -> "builds/60f03d17b515b17f3781e127ca0a6bf4e8b83ac92c22c8a25b9165e7dbad2fe1.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-06-09T16:12:09.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:33" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:33/invocations" -> (known after apply)
      ~ s3_key                         = "builds/f929941cc22bb214e2f80992b4de9a80379e19fbba521554dd058d81cbff3a9c.zip" -> "builds/7da08e0573afa8c71cfe73fe716d3be5bd449ad895872f9b4bd4529574ee3cfa.zip"
      ~ s3_object_version              = "rdAg0TcY0eT9FYZdDXJjXRp7dZaMhDF_" -> (known after apply)
        tags                           = {}
      ~ version                        = "33" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:b1034a15ea75fb460b2753400ca2d904ddcfe290,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "b1034a15ea75fb460b2753400ca2d904ddcfe290"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "33" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "fd62110a2b0f17edcfbbefdfbf99aae2-2" -> (known after apply)
      ~ id                     = "builds/f929941cc22bb214e2f80992b4de9a80379e19fbba521554dd058d81cbff3a9c.zip" -> (known after apply)
      ~ key                    = "builds/f929941cc22bb214e2f80992b4de9a80379e19fbba521554dd058d81cbff3a9c.zip" -> "builds/7da08e0573afa8c71cfe73fe716d3be5bd449ad895872f9b4bd4529574ee3cfa.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/f929941cc22bb214e2f80992b4de9a80379e19fbba521554dd058d81cbff3a9c.zip" -> "builds/7da08e0573afa8c71cfe73fe716d3be5bd449ad895872f9b4bd4529574ee3cfa.zip"
-       tags                   = {} -> null
      ~ version_id             = "rdAg0TcY0eT9FYZdDXJjXRp7dZaMhDF_" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/7da08e0573afa8c71cfe73fe716d3be5bd449ad895872f9b4bd4529574ee3cfa.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/7da08e0573afa8c71cfe73fe716d3be5bd449ad895872f9b4bd4529574ee3cfa.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1299322516270349493" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f929941cc22bb214e2f80992b4de9a80379e19fbba521554dd058d81cbff3a9c.zip" -> "builds/7da08e0573afa8c71cfe73fe716d3be5bd449ad895872f9b4bd4529574ee3cfa.zip"
          ~ "timestamp" = "1686327077248441000" -> "1687385471238200000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4410308662990564269" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/f929941cc22bb214e2f80992b4de9a80379e19fbba521554dd058d81cbff3a9c.zip" -> "builds/7da08e0573afa8c71cfe73fe716d3be5bd449ad895872f9b4bd4529574ee3cfa.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-06-09T16:12:06.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:13" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:13/invocations" -> (known after apply)
      ~ s3_key                         = "builds/9af9105f19c1e8018ea8f46cc5f6b4da1332663cbd07df0bb5053c3ab7b82fe2.zip" -> "builds/557db4e34fb8c3fba0af97991a19e66ca6bd8b8624a173e73a87a13091f9fdc7.zip"
      ~ s3_object_version              = ".0DfvgAPstcwlH6poI9ST5bgFMwl63rG" -> (known after apply)
        tags                           = {}
      ~ version                        = "13" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:b1034a15ea75fb460b2753400ca2d904ddcfe290,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "b1034a15ea75fb460b2753400ca2d904ddcfe290"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "13" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d45837b4937e8dc25c38193c3cbfe346-2" -> (known after apply)
      ~ id                     = "builds/9af9105f19c1e8018ea8f46cc5f6b4da1332663cbd07df0bb5053c3ab7b82fe2.zip" -> (known after apply)
      ~ key                    = "builds/9af9105f19c1e8018ea8f46cc5f6b4da1332663cbd07df0bb5053c3ab7b82fe2.zip" -> "builds/557db4e34fb8c3fba0af97991a19e66ca6bd8b8624a173e73a87a13091f9fdc7.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/9af9105f19c1e8018ea8f46cc5f6b4da1332663cbd07df0bb5053c3ab7b82fe2.zip" -> "builds/557db4e34fb8c3fba0af97991a19e66ca6bd8b8624a173e73a87a13091f9fdc7.zip"
-       tags                   = {} -> null
      ~ version_id             = ".0DfvgAPstcwlH6poI9ST5bgFMwl63rG" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/557db4e34fb8c3fba0af97991a19e66ca6bd8b8624a173e73a87a13091f9fdc7.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/557db4e34fb8c3fba0af97991a19e66ca6bd8b8624a173e73a87a13091f9fdc7.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4807589454930968815" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9af9105f19c1e8018ea8f46cc5f6b4da1332663cbd07df0bb5053c3ab7b82fe2.zip" -> "builds/557db4e34fb8c3fba0af97991a19e66ca6bd8b8624a173e73a87a13091f9fdc7.zip"
          ~ "timestamp" = "1686327096746604000" -> "1687385488771406800"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1230952358128535823" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/9af9105f19c1e8018ea8f46cc5f6b4da1332663cbd07df0bb5053c3ab7b82fe2.zip" -> "builds/557db4e34fb8c3fba0af97991a19e66ca6bd8b8624a173e73a87a13091f9fdc7.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-06-09T16:12:08.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:2/invocations" -> (known after apply)
      ~ s3_key                         = "builds/4ff3bb78e9dbbbc101ab3b965c735639bbc44ea326f6090d5195d429db1ac9af.zip" -> "builds/9ef0cda86277cdd5edb3b9f38e9a9575bf5a33c7d7d24298115c61fda304509e.zip"
      ~ s3_object_version              = "nk6RAvpfH_I7mW1M4XwFTWKSOi0lXbxL" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:b1034a15ea75fb460b2753400ca2d904ddcfe290,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "b1034a15ea75fb460b2753400ca2d904ddcfe290"
                # (11 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1cd9fd818db85deef67d6b6a6fabef33-2" -> (known after apply)
      ~ id                     = "builds/4ff3bb78e9dbbbc101ab3b965c735639bbc44ea326f6090d5195d429db1ac9af.zip" -> (known after apply)
      ~ key                    = "builds/4ff3bb78e9dbbbc101ab3b965c735639bbc44ea326f6090d5195d429db1ac9af.zip" -> "builds/9ef0cda86277cdd5edb3b9f38e9a9575bf5a33c7d7d24298115c61fda304509e.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/4ff3bb78e9dbbbc101ab3b965c735639bbc44ea326f6090d5195d429db1ac9af.zip" -> "builds/9ef0cda86277cdd5edb3b9f38e9a9575bf5a33c7d7d24298115c61fda304509e.zip"
-       tags                   = {} -> null
      ~ version_id             = "nk6RAvpfH_I7mW1M4XwFTWKSOi0lXbxL" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-ExtractGrantsGovDBToXML
                            cd bin/ExtractGrantsGovDBToXML
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/9ef0cda86277cdd5edb3b9f38e9a9575bf5a33c7d7d24298115c61fda304509e.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/9ef0cda86277cdd5edb3b9f38e9a9575bf5a33c7d7d24298115c61fda304509e.plan.json"
+       id                   = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5767693381188881350" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/4ff3bb78e9dbbbc101ab3b965c735639bbc44ea326f6090d5195d429db1ac9af.zip" -> "builds/9ef0cda86277cdd5edb3b9f38e9a9575bf5a33c7d7d24298115c61fda304509e.zip"
          ~ "timestamp" = "1686327096329471200" -> "1687385488664332000"
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "5026064096943954996" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/4ff3bb78e9dbbbc101ab3b965c735639bbc44ea326f6090d5195d429db1ac9af.zip" -> "builds/9ef0cda86277cdd5edb3b9f38e9a9575bf5a33c7d7d24298115c61fda304509e.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistFFISData"
      ~ last_modified                  = "2023-06-09T16:12:08.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:3/invocations" -> (known after apply)
      ~ s3_key                         = "builds/14e827daf9ce6e42298f105253e6bdcd175f1b054b309ac42224e4e99349b767.zip" -> "builds/c9633a5f8464b91212f33602a2a2d18c73a0b6c714a4f374878ecbb39f220094.zip"
      ~ s3_object_version              = "wg24DYeayevksD9u66jaj28A.KcPJyPL" -> (known after apply)
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:b1034a15ea75fb460b2753400ca2d904ddcfe290,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "b1034a15ea75fb460b2753400ca2d904ddcfe290"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "3" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6e0206331391e2966cc81820a445c4a5-2" -> (known after apply)
      ~ id                     = "builds/14e827daf9ce6e42298f105253e6bdcd175f1b054b309ac42224e4e99349b767.zip" -> (known after apply)
      ~ key                    = "builds/14e827daf9ce6e42298f105253e6bdcd175f1b054b309ac42224e4e99349b767.zip" -> "builds/c9633a5f8464b91212f33602a2a2d18c73a0b6c714a4f374878ecbb39f220094.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/14e827daf9ce6e42298f105253e6bdcd175f1b054b309ac42224e4e99349b767.zip" -> "builds/c9633a5f8464b91212f33602a2a2d18c73a0b6c714a4f374878ecbb39f220094.zip"
-       tags                   = {} -> null
      ~ version_id             = "wg24DYeayevksD9u66jaj28A.KcPJyPL" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistFFISData
                            cd bin/PersistFFISData
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/c9633a5f8464b91212f33602a2a2d18c73a0b6c714a4f374878ecbb39f220094.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/c9633a5f8464b91212f33602a2a2d18c73a0b6c714a4f374878ecbb39f220094.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4246614586482010753" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/14e827daf9ce6e42298f105253e6bdcd175f1b054b309ac42224e4e99349b767.zip" -> "builds/c9633a5f8464b91212f33602a2a2d18c73a0b6c714a4f374878ecbb39f220094.zip"
          ~ "timestamp" = "1686327096602017000" -> "1687385488719918000"
        }
    }

  # module.PersistFFISData.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4821557150267532975" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/14e827daf9ce6e42298f105253e6bdcd175f1b054b309ac42224e4e99349b767.zip" -> "builds/c9633a5f8464b91212f33602a2a2d18c73a0b6c714a4f374878ecbb39f220094.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-06-09T16:12:09.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:5/invocations" -> (known after apply)
      ~ s3_key                         = "builds/2b7e0c2c242dc6a0c523795dd5e6f0134f4e5d03140d9a5b72759b797264dc84.zip" -> "builds/f2013affac65753f37e9efd38c9c1977e2984a749942b14ddc717dbe132e2830.zip"
      ~ s3_object_version              = "8FxD7UBtjgqHCouvcMj5q2VsHrJByigM" -> (known after apply)
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:b1034a15ea75fb460b2753400ca2d904ddcfe290,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "b1034a15ea75fb460b2753400ca2d904ddcfe290"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "5" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1d75e6a00e06c71040c47dd9590f6ca5-2" -> (known after apply)
      ~ id                     = "builds/2b7e0c2c242dc6a0c523795dd5e6f0134f4e5d03140d9a5b72759b797264dc84.zip" -> (known after apply)
      ~ key                    = "builds/2b7e0c2c242dc6a0c523795dd5e6f0134f4e5d03140d9a5b72759b797264dc84.zip" -> "builds/f2013affac65753f37e9efd38c9c1977e2984a749942b14ddc717dbe132e2830.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/2b7e0c2c242dc6a0c523795dd5e6f0134f4e5d03140d9a5b72759b797264dc84.zip" -> "builds/f2013affac65753f37e9efd38c9c1977e2984a749942b14ddc717dbe132e2830.zip"
-       tags                   = {} -> null
      ~ version_id             = "8FxD7UBtjgqHCouvcMj5q2VsHrJByigM" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistGrantsGovXMLDB
                            cd bin/PersistGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/f2013affac65753f37e9efd38c9c1977e2984a749942b14ddc717dbe132e2830.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/f2013affac65753f37e9efd38c9c1977e2984a749942b14ddc717dbe132e2830.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3708799813599186642" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2b7e0c2c242dc6a0c523795dd5e6f0134f4e5d03140d9a5b72759b797264dc84.zip" -> "builds/f2013affac65753f37e9efd38c9c1977e2984a749942b14ddc717dbe132e2830.zip"
          ~ "timestamp" = "1686327077640445000" -> "1687385470601528800"
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7945258947736888365" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/2b7e0c2c242dc6a0c523795dd5e6f0134f4e5d03140d9a5b72759b797264dc84.zip" -> "builds/f2013affac65753f37e9efd38c9c1977e2984a749942b14ddc717dbe132e2830.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-06-09T16:12:09.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:4/invocations" -> (known after apply)
      ~ s3_key                         = "builds/b16b6a6f34244e772658768f7143e5c0a8640ef516a665272f5ebd0e8bce77b3.zip" -> "builds/95f2d4d27cd134981e8cf277fb963238df8d799a5b47e71708df2fa51b0e533b.zip"
      ~ s3_object_version              = "24rSj97U4Dvxa9v_2dupS3pFRTy_9cXw" -> (known after apply)
        tags                           = {}
      ~ version                        = "4" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:b1034a15ea75fb460b2753400ca2d904ddcfe290,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "b1034a15ea75fb460b2753400ca2d904ddcfe290"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "4" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "ff20b26354862ac79ced1209bc9cdb57-2" -> (known after apply)
      ~ id                     = "builds/b16b6a6f34244e772658768f7143e5c0a8640ef516a665272f5ebd0e8bce77b3.zip" -> (known after apply)
      ~ key                    = "builds/b16b6a6f34244e772658768f7143e5c0a8640ef516a665272f5ebd0e8bce77b3.zip" -> "builds/95f2d4d27cd134981e8cf277fb963238df8d799a5b47e71708df2fa51b0e533b.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/b16b6a6f34244e772658768f7143e5c0a8640ef516a665272f5ebd0e8bce77b3.zip" -> "builds/95f2d4d27cd134981e8cf277fb963238df8d799a5b47e71708df2fa51b0e533b.zip"
-       tags                   = {} -> null
      ~ version_id             = "24rSj97U4Dvxa9v_2dupS3pFRTy_9cXw" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitFFISSpreadsheet
                            cd bin/SplitFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/95f2d4d27cd134981e8cf277fb963238df8d799a5b47e71708df2fa51b0e533b.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/95f2d4d27cd134981e8cf277fb963238df8d799a5b47e71708df2fa51b0e533b.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4349985905186074214" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b16b6a6f34244e772658768f7143e5c0a8640ef516a665272f5ebd0e8bce77b3.zip" -> "builds/95f2d4d27cd134981e8cf277fb963238df8d799a5b47e71708df2fa51b0e533b.zip"
          ~ "timestamp" = "1686327097023874000" -> "1687385488483539200"
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1117248018630276607" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/b16b6a6f34244e772658768f7143e5c0a8640ef516a665272f5ebd0e8bce77b3.zip" -> "builds/95f2d4d27cd134981e8cf277fb963238df8d799a5b47e71708df2fa51b0e533b.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-06-09T16:12:08.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:32" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:32/invocations" -> (known after apply)
      ~ s3_key                         = "builds/e11b8ebe4817435d85ed14ab8c6a5945844e187348978a36907859a7d02c389d.zip" -> "builds/5aad7ed8619d49cb571e97c2dc68d3823461e4860b34d90e700b8f79d266405f.zip"
      ~ s3_object_version              = "_RIn4RRRCFPjyzfe.m_BB0zHnAw64Tyj" -> (known after apply)
        tags                           = {}
      ~ version                        = "32" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:b1034a15ea75fb460b2753400ca2d904ddcfe290,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "b1034a15ea75fb460b2753400ca2d904ddcfe290"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "32" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "aa8d30a10e7838bfda369bc2c08f5559-2" -> (known after apply)
      ~ id                     = "builds/e11b8ebe4817435d85ed14ab8c6a5945844e187348978a36907859a7d02c389d.zip" -> (known after apply)
      ~ key                    = "builds/e11b8ebe4817435d85ed14ab8c6a5945844e187348978a36907859a7d02c389d.zip" -> "builds/5aad7ed8619d49cb571e97c2dc68d3823461e4860b34d90e700b8f79d266405f.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/e11b8ebe4817435d85ed14ab8c6a5945844e187348978a36907859a7d02c389d.zip" -> "builds/5aad7ed8619d49cb571e97c2dc68d3823461e4860b34d90e700b8f79d266405f.zip"
-       tags                   = {} -> null
      ~ version_id             = "_RIn4RRRCFPjyzfe.m_BB0zHnAw64Tyj" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/5aad7ed8619d49cb571e97c2dc68d3823461e4860b34d90e700b8f79d266405f.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/5aad7ed8619d49cb571e97c2dc68d3823461e4860b34d90e700b8f79d266405f.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8164525510731337965" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/e11b8ebe4817435d85ed14ab8c6a5945844e187348978a36907859a7d02c389d.zip" -> "builds/5aad7ed8619d49cb571e97c2dc68d3823461e4860b34d90e700b8f79d266405f.zip"
          ~ "timestamp" = "1686327077383871000" -> "1687385470934062000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4017243223174389673" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/e11b8ebe4817435d85ed14ab8c6a5945844e187348978a36907859a7d02c389d.zip" -> "builds/5aad7ed8619d49cb571e97c2dc68d3823461e4860b34d90e700b8f79d266405f.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 40 to add, 13 to change, 32 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/5339396785)*